In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
from scipy import stats
from scipy.stats import shapiro
from numpy.random import randn
from numpy.random import poisson
from numpy.random import seed
from scipy.stats import ttest_1samp
from numpy.random import randn

In [2]:
df = sns.load_dataset('titanic')
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [3]:
df1 = df[["age","sex","fare"]]

In [4]:
df1.head(2)

    age     sex     fare
0  22.0    male   7.2500
1  38.0  female  71.2833

In [5]:
df1.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [6]:
# dataset update after selection of limited number of features
df2 = df[["fare","sex"]]

In [7]:
df2.head(2)

      fare     sex
0   7.2500    male
1  71.2833  female

In [8]:
# describe function used  to check the values like(mean, std,min,max) of numaric features

df2.describe()

             fare
count  891.000000
mean    32.204208
std     49.693429
min      0.000000
25%      7.910400
50%     14.454200
75%     31.000000
max    512.329200

In [9]:
# check the null value i the dataset

df1.isnull().sum()

age     177
sex       0
fare      0
dtype: int64

In [10]:
# remove the null values from the dataset df1 subset of age features
df1.dropna(subset=['age'],axis=0,inplace=True)
df1.isnull().sum()

/Users/FaizanArshad/opt/anaconda3/lib/python3.8/site-packages/pandas/util/_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

age     0
sex     0
fare    0
dtype: int64

In [15]:
# check the age and compare with a known value of 45
# one saomle t_test
ttest_1samp(df1['age'],45)

Ttest_1sampResult(statistic=-28.14522164634589, pvalue=8.569358852911548e-118)

In [16]:

# import library
from scipy.stats import ttest_1samp

# 

ttest_1samp(df1['age'],50)

stat,p = ttest_1samp(df1['age'],50)

print('stats=%.5f,p=%.5f'% (stat,p))

# make a conditional Argument for further use

if p > 0.05:
    print('probabily the same  Distribution')
else:
    print('probabily different  Distribution')

stats=-37.34248,p=0.00000
probabily not gaussian or normal Distribution

In [17]:
# import library
from scipy.stats import ttest_1samp

# 

ttest_1samp(df1['fare'],50)

stat,p = ttest_1samp(df1['fare'],50)

print('stats=%.5f,p=%.5f'% (stat,p))

# make a conditional Argument for further use

if p > 0.05:
    print('probabily the same  Distribution')
else:
    print('probabily different  Distribution')

stats=-7.72832,p=0.00000
probabily different  Distribution

## Two sample t-tests
**Independant student's t-test**

In [20]:
# we will compare the values

#splitting the datasets

df_male = df1.loc[df1['sex']=='male']
df_female = df1.loc[df1['sex']=='female']

# library

from scipy.stats import ttest_ind

# (df1['fare'],50)

stat,p = ttest_ind(df_male['age'],df_female['age'])

print('stats=%.5f,p=%.5f'% (stat,p))

# make a conditional Argument for further use

if p > 0.05:
    print('probabily the same  Distribution')
else:
    print('probabily different  Distribution')

stats=2.49921,p=0.01267
probabily different  Distribution

In [21]:
df_male.describe()

              age        fare
count  453.000000  453.000000
mean    30.726645   27.268836
std     14.678201   45.841889
min      0.420000    0.000000
25%     21.000000    7.895800
50%     29.000000   13.000000
75%     39.000000   28.500000
max     80.000000  512.329200

In [22]:
df_female.describe()

              age        fare
count  261.000000  261.000000
mean    27.915709   47.582759
std     14.110146   61.346854
min      0.750000    6.750000
25%     18.000000   13.000000
50%     27.000000   26.000000
75%     37.000000   57.979200
max     63.000000  512.329200

In [23]:
# we will compare the values

#splitting the datasets

df_male = df1.loc[df1['sex']=='male']
df_female = df1.loc[df1['sex']=='female']

# library

from scipy.stats import ttest_ind

# (df1['fare'],50)

stat,p = ttest_ind(df_male['fare'],df_female['fare'])

print('stats=%.5f,p=%.5f'% (stat,p))

# make a conditional Argument for further use

if p > 0.05:
    print('probabily the same  Distribution')
else:
    print('probabily different  Distribution')

stats=-5.02296,p=0.00000
probabily different  Distribution

In [30]:
df_male_first = df.loc[df['class']=='First']
df_male_second = df.loc[df['class']=='Second']
df_male_third = df.loc[df['class']=='Third']
df_male_third.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.250,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.925,S,Third,woman,False,NaN,Southampton,yes,True

In [31]:
from scipy.stats import ttest_rel
# apply test to compare class and class iii

ttest_rel(df_male_first['age'],df_male_third['age'])

ValueError: unequal length arrays

In [36]:
df_male_first_n = df_male_first.sample(n =100)
df_male_second_n = df_male_second.sample(n = 100)
df_male_third_n = df_male_third.sample(n =100)

In [37]:
df_male_first_n.describe()

         survived  pclass        age      sibsp       parch        fare
count  100.000000   100.0  88.000000  100.00000  100.000000  100.000000
mean     0.610000     1.0  37.612727    0.36000    0.240000   82.500208
std      0.490207     0.0  15.054204    0.52262    0.552679   82.610977
min      0.000000     1.0   0.920000    0.00000    0.000000    0.000000
25%      0.000000     1.0  27.750000    0.00000    0.000000   30.375000
50%      1.000000     1.0  36.000000    0.00000    0.000000   61.800000
75%      1.000000     1.0  47.250000    1.00000    0.000000   91.079200
max      1.000000     1.0  80.000000    2.00000    2.000000  512.329200

In [39]:
from scipy.stats import ttest_rel
# apply test to compare class and class iii

ttest_rel(df_male_first_n['fare'],df_male_third_n['fare'])

Ttest_relResult(statistic=8.144408077167139, pvalue=1.1762452769673508e-12)